Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The ViewMarkTagAttributes class contains attributes for view mark tags.

Tekla.Structures.Drawing.View.ViewMarkTagAttributes.TagAlignment
The tag text alignment.

Tekla.Structures.Drawing.View.ViewMarkTagAttributes.#ctor
Creates a new mark tag attributes instance.

Tekla.Structures.Drawing.View.ViewMarkTagAttributes.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Drawing.TagLocation,Tekla.Structures.Drawing.TextAlignment,Tekla.Structures.Drawing.ContainerElement)
Creates a new mark tag attributes instance with the given offset, location, alignment and content.
offset: The offset of the mark tag to be used.
location: The location of the mark tag to be used.
alignment: The alignment of the mark tag text to be used.
tagContent: The content of the mark tag to be used.

Tekla.Structures.Drawing.View.ViewMarkTagAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.